l1117/NRF51822_Datelog/main.c
/**@brief Function for handling the Connection interval timeout.
 *
 * @details This function will be called when the connection interval timer expires. This will
 *          trigger another characteristic notification to the peer.
 *
 * @param[in]   p_context   Pointer used for passing some arbitrary information (context) from the
 *                          app_start_timer() call to the timeout handler.
 */
static void connection_interval_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);

    // Into next connection interval. Send one notification.
				char_notify();
}
static void example_cb_handler(pstorage_handle_t  * handle,
															 uint8_t              op_code,
                               uint32_t             result,
                               uint8_t            * p_data,
                               uint32_t             data_len)
{
		if(handle->block_id == pstorage_wait_handle) { pstorage_wait_flag = 0; }  //If we are waiting for this callback, clear the wait flag.
}

static void s5tm_timeout_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
		uint8_t data_id = 1, data_pos = false;
    static uint32_t data_saved ;  //must be STATIC for pstorage_store()
		uint32_t err_code=0;
		uint8_t timer_flash_id = ((uint8_t)( timer_counter/TIME_PERIOD));
//		uint16_t len = 4;
//		timer_counter+=TIME_PERIOD;
				battery_start(ADC_AIN);	 //For 3.3V boster
//					battery_start(6);  //For 3.7V Li Battery 
	
//				ble_bas_battery_level_update(&m_bas,batt_lvl_in_milli_volts/100);  //For display 3.0V*100 on IOS
				
				nrf_gpio_pin_set (UART_POWER);												//Open power and UART for 5TM 
//				nrf_gpio_pin_clear (UART_POWER);												//Open power and UART for 5TM 

				NRF_UART0->POWER = (UART_POWER_POWER_Enabled << UART_POWER_POWER_Pos);
				simple_uart_config(NULL, UART_TX, NULL, UART_RX, false);
				uint8_t cr; //rx_count=10;
				Vtm_humi=0,Vtm_unknow=0,Vtm_temp=0;
				for (uint8_t i=0;i<50;i++){										//Get date from 5tm 
//						m_addl_adv_manuf_data[rx_count++]=cr;  //simple_uart_put(cr);

					if (simple_uart_get_with_timeout(4, &cr)) {
							if (cr == 0x20) data_pos = true;    //5TM data start postion.
							if ((cr>>4) == 3 ) { 
								switch (data_id){
									case 1: {
										Vtm_humi = Vtm_humi<<4;
										Vtm_humi |= (cr & 0x0F) ;
										break;
										}
									case 2:  {
										Vtm_unknow = Vtm_unknow<<4;
										Vtm_unknow |= (cr & 0x0F) ;
										break;
										}
									case 3: {
										Vtm_temp = Vtm_temp<<4;
										Vtm_temp |= (cr & 0x0F) ;
										break;
										}
									default: break;
								}
							}
						else if(data_pos) data_id++;
					}
		}	
				NRF_UART0->POWER = (UART_POWER_POWER_Disabled << UART_POWER_POWER_Pos);
//				nrf_gpio_cfg_output(UART_RX);   //Add this line will be more power.

				nrf_gpio_pin_clear (UART_POWER);
//				nrf_gpio_pin_set (UART_POWER);
				sd_temp_get(&nrf_temp);  													//Get Cpu tempreature
#ifdef V5TM
				data_saved = (Vtm_humi << 16) + Vtm_temp ;
#else
				data_saved = timer_counter ; //test flash write
#endif
						pstorage_handle_t 		flash_handle;
//						pstorage_block_identifier_get(&flash_base_handle,((((timer_counter/TIME_PERIOD)>>8))%PSTORAGE_MAX_APPLICATIONS), &flash_handle);
						pstorage_block_identifier_get(&flash_base_handle,((timer_counter/(TIME_PERIOD*(PSTORAGE_PAGE_SIZE/4)))%PSTORAGE_MAX_APPLICATIONS), &flash_handle);
						if (flash_handle.block_id != flash_handle_last.block_id || flash_handle.module_id != flash_handle_last.module_id) {
								flash_handle_last = flash_handle;
								err_code = pstorage_clear(&flash_handle,PSTORAGE_PAGE_SIZE);
							}
						err_code = pstorage_store(&flash_handle, (uint8_t * )&data_saved, 4, timer_flash_id*4);

			 *( (uint32_t *)     m_addl_adv_manuf_data)  = timer_counter ;
			 *( (uint16_t *) (m_addl_adv_manuf_data+4))  = Vtm_temp ;
			 *( (uint16_t *) (m_addl_adv_manuf_data+6))  = Vtm_unknow ;
			 *( (uint16_t *) (m_addl_adv_manuf_data+8))  = Vtm_humi;
			 *( (uint16_t *) (m_addl_adv_manuf_data+10)) = batt_lvl_in_milli_volts ;
			 *( (uint32_t *) (m_addl_adv_manuf_data+12)) = nrf_temp ;
				err_code = ble_advdata_set(&advdata, NULL);
				APP_ERROR_CHECK(err_code);
}

static void timecounter_handler(void * p_context)
{
    UNUSED_PARAMETER(p_context);
		timer_counter += TIME_STEP;
		if (timer_counter%TIME_PERIOD){  
				*( (uint32_t *) m_addl_adv_manuf_data) = timer_counter ;
			uint32_t	err_code = ble_advdata_set(&advdata, NULL);
//				APP_ERROR_CHECK(err_code);
			}
		else s5tm_timeout_handler(NULL);
}




/**@brief Function for starting application timers.
 *
 * @details This function will be start two timers - one for the time duration for which 
 *          notifications have to be sent to the peer and another for the interval between two 
 *          notifications (which is also the connection interval).
 */
static void application_timers_start(void)
{
    uint32_t err_code;

    // Start connection interval timer.     
//    err_code = app_timer_start(m_conn_int_timer_id,
//                               APP_TIMER_TICKS(APP_CFG_CONNECTION_INTERVAL, APP_TIMER_PRESCALER),
//                               NULL);
//    APP_ERROR_CHECK(err_code);

    // Start characteristic notification timer.
    err_code = app_timer_start(m_notif_timer_id, CHAR_NOTIF_TIMEOUT_IN_TKS, NULL);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for Stopping application timers.
 */
static void application_timers_stop(void)
{
    uint32_t err_code;
    
    err_code = app_timer_stop(m_notif_timer_id);
    APP_ERROR_CHECK(err_code);

//    err_code = app_timer_stop(m_conn_int_timer_id);
//    APP_ERROR_CHECK(err_code);

//    err_code = app_timer_create(&m_s5tm_timer_id,
//                                APP_TIMER_MODE_REPEATED,
//                                s5tm_timeout_handler);
//    APP_ERROR_CHECK(err_code);

}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code;
    uint32_t count;

    // Verify if there is any flash access pending, if yes delay starting advertising until
    // it's complete.
		err_code = pstorage_access_status_get(&count);
		APP_ERROR_CHECK(err_code);
		if (count) nrf_delay_ms(20);
    err_code = sd_ble_gap_adv_start(&m_adv_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the Timer initialization.
 *
* @details Initializes the timer module.
*/
static void timers_init(void)
{
    uint32_t err_code;

