l1117/NRF51822_Datelog/main.c
    // Initialize timer module
    APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_MAX_TIMERS, APP_TIMER_OP_QUEUE_SIZE, false);

    // Create timers
    err_code = app_timer_create(&m_conn_int_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                connection_interval_timeout_handler);
    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_notif_timer_id,
                                APP_TIMER_MODE_SINGLE_SHOT,
                                notif_timeout_handler);
    APP_ERROR_CHECK(err_code);


//    err_code = app_timer_create(&m_s5tm_timer_id,
//                                APP_TIMER_MODE_REPEATED,
//                                s5tm_timeout_handler);
//    APP_ERROR_CHECK(err_code);

    err_code = app_timer_create(&m_timecounter_id,
                                APP_TIMER_MODE_REPEATED,
                                timecounter_handler);
    APP_ERROR_CHECK(err_code);

}


/**@brief Function for evaluating the value written in CCCD 
 *
 * @details This shall be called when there is a write event received from the stack. This 
 *          function will evaluate whether or not the peer has enabled notifications and
 *          start/stop notifications accordingly.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_write(ble_evt_t * p_ble_evt)
{
//		uint32_t err_code;
    ble_gatts_evt_write_t * p_evt_write = &p_ble_evt->evt.gatts_evt.params.write;
    if ((p_evt_write->handle == m_bas.Vtm_date_time_handles.value_handle) && (p_evt_write->len == 1))
			flash_block_num = *p_evt_write->data;
		else if ((p_evt_write->handle == m_bas.Nrf_name_handles.value_handle) && (p_evt_write->len == 4))
			{
				adv_name[0] = *p_evt_write->data;
				adv_name[1] = *(p_evt_write->data+1);
				adv_name[2] = *(p_evt_write->data+2);
				adv_name[3] = *(p_evt_write->data+3);
				gap_params_init();
				m_addl_adv_manuf_data[16] = adv_name[0];
				m_addl_adv_manuf_data[17] = adv_name[1];
				m_addl_adv_manuf_data[18] = adv_name[2];
				m_addl_adv_manuf_data[19] = adv_name[3];
			  ble_advdata_set(&advdata, NULL);

			}
    else if ((p_evt_write->handle == m_bas.Vtm_date_time_handles.cccd_handle) && (p_evt_write->len == 2))
//    if ((p_evt_write->handle == m_bas.battery_level_handles.cccd_handle) && (p_evt_write->len == 2))
    {
        // CCCD written. Start notifications
        m_is_notifying_enabled = ble_srv_is_notification_enabled(p_evt_write->data);

        if (m_is_notifying_enabled)
        {
						application_timers_stop();
//						timer_shifting = (timer_counter/TIME_PERIOD)& 0xfffffffC;  // intergreat /4
						timer_shifting = 0;
						pstorage_handle_t flash_handle;
						uint16_t len=4;
//						sd_ble_gatts_value_get(m_bas.Vtm_date_time_handles.value_handle,0, &len, (uint8_t *)&flash_block_num);
						if (flash_block_num > PSTORAGE_MAX_APPLICATIONS) flash_block_num = PSTORAGE_MAX_APPLICATIONS-1;
						pstorage_block_identifier_get(&flash_base_handle,flash_block_num, &flash_handle);
						pstorage_load((uint8_t *)flash_page_data, &flash_handle,1024,0);
						flash_page_data[259] = flash_block_num-- ;
						flash_page_data[258] = PSTORAGE_MAX_APPLICATIONS;
						flash_page_data[257] = PSTORAGE_PAGE_SIZE;
						flash_page_data[256] = TIME_PERIOD;
						ble_gatts_value_t gatts_value;
						memset(&gatts_value, 0, sizeof(gatts_value));
						gatts_value.len     = sizeof(uint32_t);
						gatts_value.offset  = 0;
						gatts_value.p_value = (uint8_t *)&flash_block_num;

						sd_ble_gatts_value_set(m_bas.conn_handle, m_bas.Vtm_date_time_handles.value_handle, &gatts_value);
            char_notify();
						application_timers_start();
        }
    }
}


/**@brief Function for handling the Application's BLE Stack events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 */
static void on_ble_evt(ble_evt_t * p_ble_evt)
{
    uint32_t err_code = NRF_SUCCESS;
		uint32_t ss;
		uint16_t len = 4;
    
    switch (p_ble_evt->header.evt_id)
    {
        case BLE_GAP_EVT_CONNECTED:
            m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
						nrf_gpio_pin_set (LED_PIN);												//Led on.
						application_timers_start();
						ble_gap_conn_params_t   gap_conn_params;
						gap_conn_params.min_conn_interval = ((4 * APP_CFG_CONNECTION_INTERVAL) / 5);  //= 10
						gap_conn_params.max_conn_interval = (4 * 24) / 5;
						gap_conn_params.slave_latency     = 4;		//SLAVE_LATENCY;
						gap_conn_params.conn_sup_timeout  = MSEC_TO_UNITS(400, UNIT_10_MS) ;	//CONN_SUP_TIMEOUT;
//						gap_conn_params.min_conn_interval = (4 * 20) / 5;	//Interval Max * (Slave Latency + 1) <= 2 seconds
//						gap_conn_params.max_conn_interval = (4 * 40) / 5;	//Interval Min + 20 ms >= Interval Max Slave Latency = 4
//						gap_conn_params.slave_latency     = 8;		//connSupervisionTimeout <= 6 seconds
//						gap_conn_params.conn_sup_timeout  = MSEC_TO_UNITS(1330, UNIT_10_MS) ;	//Interval Max * (Slave Latency + 1) * 3 < connSupervisionTimeout
						err_code=sd_ble_gap_conn_param_update(m_conn_handle,&gap_conn_params);
            APP_ERROR_CHECK(err_code);
//						flash_block_num = ((timer_shifting)>>8)%PSTORAGE_MAX_APPLICATIONS;
						flash_block_num = (timer_counter/(TIME_PERIOD*(PSTORAGE_PAGE_SIZE/4)))%PSTORAGE_MAX_APPLICATIONS;
//						ss = HTONL(timer_counter);
						ble_gatts_value_t gatts_value;
						memset(&gatts_value, 0, sizeof(gatts_value));
						gatts_value.len     = sizeof(uint32_t);
						gatts_value.offset  = 0;
						gatts_value.p_value = (uint8_t *)&flash_block_num;

						sd_ble_gatts_value_set(m_bas.conn_handle, m_bas.Vtm_date_time_handles.value_handle, &gatts_value);
// Updata server data for display  
						ss = HTONL(batt_lvl_in_milli_volts);
						gatts_value.p_value = (uint8_t *)&ss;

						sd_ble_gatts_value_set(m_bas.conn_handle, m_bas.battery_level_handles.value_handle, &gatts_value);
						ss = HTONL(Vtm_temp);
						sd_ble_gatts_value_set(m_bas.conn_handle,m_bas.Vtm_temp_level_handles.value_handle, &gatts_value);
						ss = HTONL(Vtm_humi);
						sd_ble_gatts_value_set(m_bas.conn_handle,m_bas.Vtm_humi_level_handles.value_handle, &gatts_value);
						ss = HTONL(nrf_temp);
						sd_ble_gatts_value_set(m_bas.conn_handle,m_bas.Nrf_temp_level_handles.value_handle, &gatts_value);
						gatts_value.p_value = (uint8_t *)adv_name;

