l1117/NRF51822_Datelog/main.c
    timers_init();
    ble_stack_init();
    scheduler_init();    

		pstorage_init();
		param.block_size  = PSTORAGE_PAGE_SIZE;                   //Select block size of 16 bytes
		param.block_count = PSTORAGE_MAX_APPLICATIONS;           	//Select 10 blocks, total of 160 bytes
		param.cb          = example_cb_handler;   								//Set the pstorage callback handler
		err_code = pstorage_register(&param, &flash_base_handle);
    gap_params_init();
//    sd_ble_gap_tx_power_set(4);
		service_add();
		connectable_adv_init();
//    advertising_data_init();
		{
			APP_ERROR_CHECK_BOOL(sizeof(flags) == ADV_FLAGS_LEN);  // Assert that these two values of the same.
			// Build and set advertising data
			memset(&advdata, 0, sizeof(advdata));
//			*( (uint32_t *) (m_addl_adv_manuf_data+16)) = *(uint32_t *) adv_name;
			m_addl_adv_manuf_data[16] = adv_name[0];
			m_addl_adv_manuf_data[17] = adv_name[1];
			m_addl_adv_manuf_data[18] = adv_name[2];
			m_addl_adv_manuf_data[19] = adv_name[3];
			manuf_data.company_identifier = COMPANY_IDENTIFIER;
			manuf_data.data.size          = ADV_ADDL_MANUF_DATA_LEN;
			manuf_data.data.p_data        = m_addl_adv_manuf_data;
//			advdata.name_type							= BLE_ADVDATA_SHORT_NAME;
//			advdata.short_name_len				= BLE_ADVDATA_SHORT_NAME_LEN;
			advdata.flags.size            = sizeof(flags);
			advdata.flags.p_data          = &flags;
			advdata.p_manuf_specific_data = &manuf_data;
			err_code = ble_advdata_set(&advdata, NULL);
			APP_ERROR_CHECK(err_code);
			}
		advertising_start();
//    err_code = app_timer_start(m_s5tm_timer_id,  APP_TIMER_TICKS(5000, APP_TIMER_PRESCALER), NULL);
    err_code = app_timer_start(m_timecounter_id,  APP_TIMER_TICKS(TIME_STEP*1000, APP_TIMER_PRESCALER), NULL);

		nrf_gpio_pin_clear (LED_PIN);												//Led off.

		for(;;)	{
      app_sched_execute();
			power_manage();
		}
}

/** 
 * @}
 */
